{
  "changes": [
    {
      "date": "2020-05-10",
      "title": "Added a list of recent updates, accessed through the new \"Updates\" item in the toolbar."
    },
    {
      "date": "2020-05-11",
      "title": "Added an option to export data to Roam Research from the user page."
    },
    {
      "date": "2020-05-11",
      "title": "Fixed bug where adding a parent would collapse all items."
    },
    {
      "date": "2020-05-12",
      "title": "Added keyboard shortcut Alt+F for \"Find\" action."
    },
    {
      "date": "2020-05-12",
      "title": "Changed link UI so that links are now shown with a bullet next to them."
    },
    {
      "date": "2020-05-12",
      "title": "Made my task list publicly available here: https://thinktool.io/work.html"
    },
    {
      "date": "2020-05-12",
      "title": "Changed bullets such that collapsed bullets are now rings, and expanded bullets are filled discs."
    },
    {
      "date": "2020-05-15",
      "title": "Made it possible to toggle whether or not the toolbar is shown."
    },
    {
      "date": "2020-05-16",
      "title": "Show a bullet graphic next to the note that is currently zoomed in, instead of highlighting it in bold."
    },
    {
      "date": "2020-05-16",
      "title": "Improve display of update list on devices with narrow screens."
    },
    {
      "date": "2020-05-23",
      "title": "Created a very basic prototype of an offline desktop client, currently just containing the demo."
    },
    {
      "date": "2020-05-24",
      "title": "Removed link to user page in demo."
    },
    {
      "date": "2020-05-27",
      "title": "Implemented saving and loading in desktop client."
    },
    {
      "date": "2020-05-29",
      "title": "Fixed a bug in the demo that would cause all items to show up as empty until clicked."
    },
    {
      "date": "2020-05-31",
      "title": "Fixed a bug where no items showed up, and making any changes would crash the app."
    },
    {
      "date": "2020-05-31",
      "title": "Fixed a bug where links would sometimes \"eat\" nearby characters at the beginning and end of items."
    },
    {
      "date": "2020-05-31",
      "title": "Improved appearance of landing page in Safari 13.0."
    },
    {
      "date": "2020-05-31",
      "title": "Fixed bug where you couldn't click on toolbar items on macOS."
    },
    {
      "date": "2020-05-31",
      "title": "Improved keyboard shortcuts on macOS."
    },
    {
      "date": "2020-06-05",
      "title": "Wrote a more in-depth tutorial for Thinktool here: https://thinktool.io/tutorial.html"
    },
    {
      "date": "2020-06-05",
      "title": "Fixed crash when manually typing link to non-existent item and then editing that item's content."
    },
    {
      "date": "2020-06-14",
      "title": "Fixed a bug where any selected text would not be used correctly in the popup when adding a link, sibling, child or parent."
    },
    {
      "date": "2020-06-29",
      "title": "Add basic versoin of 'Pages' feature, which lets you mark important notes as pages. Currently, this just shows a border around the page."
    },
    {
      "date": "2020-06-30",
      "title": "Improved spacing and layout of pages in the outline."
    },
    {
      "date": "2020-06-30",
      "title": "Pages are now expanded by default. (Reverted 2020-07-17.)"
    },
    {
      "date": "2020-06-30",
      "title": "Simplified bullet graphics, so they now only distinguish between expanded and collapsed states."
    },
    {
      "date": "2020-06-30",
      "title": "Improved selection popup appearance and UX. Selecting a match is now preferred to creating a new item by default."
    },
    {
      "date": "2020-07-01",
      "title": "Fixed bug causing an infinite loop when looking at a page that was its own ancestor."
    },
    {
      "date": "2020-07-01",
      "title": "Label 'Create new item' in item selection popup."
    },
    {
      "date": "2020-07-01",
      "title": "Fixed bug where bullet next to 'References' was too small."
    },
    {
      "date": "2020-07-01",
      "title": "Fixed behavior of external links in desktop client, so they now open in system browser."
    },
    {
      "date": "2020-07-03",
      "title": "Changed appearance of internal links to make them more obvious."
    },
    {
      "date": "2020-07-03",
      "title": "Changed behavior of opened internal links, so that toggling a link in the tree removes it instead of just collapsing it."
    },
    {
      "date": "2020-07-03",
      "title": "Added full support for pages to desktop client."
    },
    {
      "date": "2020-07-05",
      "title": "Changed appearance of internal links and pages."
    },
    {
      "date": "2020-07-17",
      "title": "Pages are no longer expanded automatically."
    },
    {
      "date": "2020-07-17",
      "title": "Changed appearance of selected (zoomed-in) item to make its behavior less surprising."
    },
    {
      "date": "2020-07-23",
      "title": "Made a short \"slideshow\" that introduces the core features of Thinktool when you first start the app."
    },
    {
      "date": "2020-07-25",
      "title": "Changed UI of references so that it's now a heading instead of a node in the outline."
    },
    {
      "date": "2020-07-25",
      "title": "Improved appearance of internal links that are long enough to cause line breaks."
    },
    {
      "date": "2020-07-25",
      "title": "Added indicator when hovering over bullet to make it more obvious that you can click on it."
    },
    {
      "date": "2020-07-26",
      "title": "Tweaked UI of opened links so the border is now only around the item itself, not its children"
    },
    {
      "date": "2020-07-26",
      "title": "Added border to other parents to make them stand out more."
    },
    {
      "date": "2020-07-26",
      "title": "Made various changes to the typography of the app itself."
    },
    {
      "date": "2020-07-26",
      "title": "Made some minor improvements to the tutorial."
    },
    {
      "date": "2020-07-26",
      "title": "Improved appearance of other parents by using a different bullet graphic instead of border."
    },
    {
      "date": "2020-07-26",
      "title": "Also added special bullet graphic for references, to match parents."
    },
    {
      "date": "2020-07-27",
      "title": "Updated appearance of links to match new parents and references style."
    },
    {
      "date": "2020-07-27",
      "title": "Fixed appearance of links that would have a line break inserted between the bullet and the first word."
    },
    {
      "date": "2020-07-28",
      "title": "Various minor UI improvements, including toolbar, search popup and tutorial."
    },
    {
      "date": "2020-07-28",
      "title": "Added 'Home' action to the toolbar."
    },
    {
      "date": "2020-07-28",
      "title": "Improved appearance of top bar."
    },
    {
      "date": "2020-08-01",
      "title": "Removed pages again. I wasn't really able to do anything interesting with this feature."
    },
    {
      "date": "2020-08-02",
      "title": "Made it possible to middle click or shift click a link to jump to it."
    },
    {
      "date": "2020-08-02",
      "title": "Renamed 'Zoom' to 'Jump'."
    },
    {
      "date": "2020-08-02",
      "title": "Fixed bug where it was sometimes impossible to expand items that only had other parents but no children."
    },
    {
      "date": "2020-08-05",
      "title": "Added link to 'r/thinktool' subreddit to toolbar and mentioned it in tutorial."
    },
    {
      "date": "2020-08-05",
      "title": "Show other parents above items (instead of showing them as children)."
    },
    {
      "date": "2020-08-05",
      "title": "Clicking on parents now jumps there by default, instead of expanding them below the item."
    },
    {
      "date": "2020-08-06",
      "title": "When pasting multiple paragraphs, each paragaph is now inserted as its own item."
    },
    {
      "date": "2020-08-06",
      "title": "(Desktop client:) Removed the unused menu bar."
    },
    {
      "date": "2020-08-21",
      "title": "Various under-the-hood improvements to the editor component."
    },
    {
      "date": "2020-08-26",
      "title": "Text cursor is now placed in the correct position after inserting a link."
    },
    {
      "date": "2020-08-29",
      "title": "Pressing Enter while editing an item now always inserts a new item. Items can no longer contain newlines."
    },
    {
      "date": "2020-09-04",
      "title": "Fixed bug where inserting a link as the only text in an empty item wouldn't do anything."
    },
    {
      "date": "2020-09-04",
      "title": "Fixed minor bug with the appearance of the search popup."
    },
    {
      "date": "2020-09-11",
      "title": "Content of links to other items is now shown even in the active editor."
    },
    {
      "date": "2020-09-14",
      "title": "Links to other items are now clickable in the active editor."
    },
    {
      "date": "2020-09-14",
      "title": "Improved consistency and apparance of links to other items in the active editor."
    },
    {
      "date": "2020-09-19",
      "title": "URLs are now clickable in the active editor."
    },
    {
      "date": "2020-09-19",
      "title": "Overhauled editor component. Now you no longer have to click on an item twice to focus it."
    },
    {
      "date": "2020-09-20",
      "title": "Fixed a visual bug with the 'New Item' placeholder item."
    },
    {
      "date": "2020-09-20",
      "title": "Fixed a bug that would cause newly inserted spaces at the end of an item to disappear when using Firefox."
    },
    {
      "date": "2020-09-20",
      "title": "Greatly improved search algorithm, which now supports fuzzy matches and relevance ranking."
    },
    {
      "date": "2020-09-23",
      "title": "Fixed crash that would happen when viewing some types of empty items."
    },
    {
      "date": "2020-09-25",
      "title": "Improved initial load performance for large databases."
    },
    {
      "date": "2020-09-28",
      "title": "Broken links to items that have been deleted are now shown explicitly."
    },
    {
      "date": "2020-10-16",
      "title": "It is now possible to middle click or shift-click item links to jump there."
    },
    {
      "date": "2020-10-16",
      "title": "Shift-clicking a bullet now also jumps there. (Previously, only middle clicking did this.)"
    },
    {
      "date": "2020-10-16",
      "title": "Fixed issue where nodes with other parents would indicate that they could be toggled, even if they had no children or references."
    }
  ]
}
